ldom22/EmbeddedTetris/Project_Headers/mc9s12zvc192.h
#define PPSP_PPSP0_MASK                 1U
#define PPSP_PPSP1_MASK                 2U
#define PPSP_PPSP2_MASK                 4U
#define PPSP_PPSP3_MASK                 8U
#define PPSP_PPSP4_MASK                 16U
#define PPSP_PPSP5_MASK                 32U
#define PPSP_PPSP6_MASK                 64U
#define PPSP_PPSP7_MASK                 128U


/*** PIEP - Port P Interrupt Enable Register; 0x000002F6 ***/
typedef union {
  byte Byte;
  struct {
    byte PIEP0       :1;                                       /* Port P interrupt enable 0 */
    byte PIEP1       :1;                                       /* Port P interrupt enable 1 */
    byte PIEP2       :1;                                       /* Port P interrupt enable 2 */
    byte PIEP3       :1;                                       /* Port P interrupt enable 3 */
    byte PIEP4       :1;                                       /* Port P interrupt enable 4 */
    byte PIEP5       :1;                                       /* Port P interrupt enable 5 */
    byte PIEP6       :1;                                       /* Port P interrupt enable 6 */
    byte PIEP7       :1;                                       /* Port P interrupt enable 7 */
  } Bits;
} PIEPSTR;
extern volatile PIEPSTR _PIEP @0x000002F6;
#define PIEP                            _PIEP.Byte
#define PIEP_PIEP0                      _PIEP.Bits.PIEP0
#define PIEP_PIEP1                      _PIEP.Bits.PIEP1
#define PIEP_PIEP2                      _PIEP.Bits.PIEP2
#define PIEP_PIEP3                      _PIEP.Bits.PIEP3
#define PIEP_PIEP4                      _PIEP.Bits.PIEP4
#define PIEP_PIEP5                      _PIEP.Bits.PIEP5
#define PIEP_PIEP6                      _PIEP.Bits.PIEP6
#define PIEP_PIEP7                      _PIEP.Bits.PIEP7

#define PIEP_PIEP0_MASK                 1U
#define PIEP_PIEP1_MASK                 2U
#define PIEP_PIEP2_MASK                 4U
#define PIEP_PIEP3_MASK                 8U
#define PIEP_PIEP4_MASK                 16U
#define PIEP_PIEP5_MASK                 32U
#define PIEP_PIEP6_MASK                 64U
#define PIEP_PIEP7_MASK                 128U


/*** PIFP - Port P Interrupt Flag Register; 0x000002F7 ***/
typedef union {
  byte Byte;
  struct {
    byte PIFP0       :1;                                       /* Port P interrupt flag 0 */
    byte PIFP1       :1;                                       /* Port P interrupt flag 1 */
    byte PIFP2       :1;                                       /* Port P interrupt flag 2 */
    byte PIFP3       :1;                                       /* Port P interrupt flag 3 */
    byte PIFP4       :1;                                       /* Port P interrupt flag 4 */
    byte PIFP5       :1;                                       /* Port P interrupt flag 5 */
    byte PIFP6       :1;                                       /* Port P interrupt flag 6 */
    byte PIFP7       :1;                                       /* Port P interrupt flag 7 */
  } Bits;
} PIFPSTR;
extern volatile PIFPSTR _PIFP @0x000002F7;
#define PIFP                            _PIFP.Byte
#define PIFP_PIFP0                      _PIFP.Bits.PIFP0
#define PIFP_PIFP1                      _PIFP.Bits.PIFP1
#define PIFP_PIFP2                      _PIFP.Bits.PIFP2
#define PIFP_PIFP3                      _PIFP.Bits.PIFP3
#define PIFP_PIFP4                      _PIFP.Bits.PIFP4
#define PIFP_PIFP5                      _PIFP.Bits.PIFP5
#define PIFP_PIFP6                      _PIFP.Bits.PIFP6
#define PIFP_PIFP7                      _PIFP.Bits.PIFP7

#define PIFP_PIFP0_MASK                 1U
#define PIFP_PIFP1_MASK                 2U
#define PIFP_PIFP2_MASK                 4U
#define PIFP_PIFP3_MASK                 8U
#define PIFP_PIFP4_MASK                 16U
#define PIFP_PIFP5_MASK                 32U
#define PIFP_PIFP6_MASK                 64U
#define PIFP_PIFP7_MASK                 128U


/*** OCPEP - Port P Over-Current Protection Enable Register; 0x000002F9 ***/
typedef union {
  byte Byte;
  struct {
    byte OCPEP0      :1;                                       /* Over-Current Protection Enable on PP0 */
    byte             :1; 
    byte OCPEP2      :1;                                       /* Over-Current Protection Enable on PP2 */
    byte             :1; 
    byte OCPEP4      :1;                                       /* Over-Current Protection Enable on PP4 */
    byte OCPEP5      :1;                                       /* Over-Current Protection Enable on PP5 */
    byte OCPEP6      :1;                                       /* Over-Current Protection Enable on PP6 */
    byte             :1; 
  } Bits;
  struct {
    byte grpOCPEP :1;
    byte         :1;
    byte grpOCPEP_2 :1;
    byte         :1;
    byte grpOCPEP_4 :3;
    byte         :1;
  } MergedBits;
} OCPEPSTR;
extern volatile OCPEPSTR _OCPEP @0x000002F9;
#define OCPEP                           _OCPEP.Byte
#define OCPEP_OCPEP0                    _OCPEP.Bits.OCPEP0
#define OCPEP_OCPEP2                    _OCPEP.Bits.OCPEP2
#define OCPEP_OCPEP4                    _OCPEP.Bits.OCPEP4
#define OCPEP_OCPEP5                    _OCPEP.Bits.OCPEP5
#define OCPEP_OCPEP6                    _OCPEP.Bits.OCPEP6
#define OCPEP_OCPEP_4                   _OCPEP.MergedBits.grpOCPEP_4

#define OCPEP_OCPEP0_MASK               1U
#define OCPEP_OCPEP2_MASK               4U
#define OCPEP_OCPEP4_MASK               16U
#define OCPEP_OCPEP5_MASK               32U
#define OCPEP_OCPEP6_MASK               64U
#define OCPEP_OCPEP_4_MASK              112U
#define OCPEP_OCPEP_4_BITNUM            4U


/*** OCIEP - Port P Over-Current Interrupt Enable Register; 0x000002FA ***/
typedef union {
  byte Byte;
  struct {
    byte OCIEP0      :1;                                       /* Over-Current Interrupt Enable on PP0 */
    byte             :1; 
    byte OCIEP2      :1;                                       /* Over-Current Interrupt Enable on PP2 */
    byte             :1; 
    byte OCIEP4      :1;                                       /* Over-Current Interrupt Enable on PP4 */
    byte OCIEP5      :1;                                       /* Over-Current Interrupt Enable on PP5 */
    byte OCIEP6      :1;                                       /* Over-Current Interrupt Enable on PP6 */
    byte             :1; 
  } Bits;
  struct {
    byte grpOCIEP :1;
    byte         :1;
    byte grpOCIEP_2 :1;
    byte         :1;
    byte grpOCIEP_4 :3;
    byte         :1;
  } MergedBits;
} OCIEPSTR;
extern volatile OCIEPSTR _OCIEP @0x000002FA;
#define OCIEP                           _OCIEP.Byte
#define OCIEP_OCIEP0                    _OCIEP.Bits.OCIEP0
#define OCIEP_OCIEP2                    _OCIEP.Bits.OCIEP2
#define OCIEP_OCIEP4                    _OCIEP.Bits.OCIEP4
#define OCIEP_OCIEP5                    _OCIEP.Bits.OCIEP5
#define OCIEP_OCIEP6                    _OCIEP.Bits.OCIEP6
#define OCIEP_OCIEP_4                   _OCIEP.MergedBits.grpOCIEP_4

#define OCIEP_OCIEP0_MASK               1U
#define OCIEP_OCIEP2_MASK               4U
#define OCIEP_OCIEP4_MASK               16U
#define OCIEP_OCIEP5_MASK               32U
#define OCIEP_OCIEP6_MASK               64U
#define OCIEP_OCIEP_4_MASK              112U
#define OCIEP_OCIEP_4_BITNUM            4U


/*** OCIFP - Port P Over-Current Interrupt Flag Register; 0x000002FB ***/
typedef union {
  byte Byte;
  struct {
    byte OCIFP0      :1;                                       /* Over-Current Interrupt Flag on PP0 */
    byte             :1; 
    byte OCIFP2      :1;                                       /* Over-Current Interrupt Flag on PP2 */
    byte             :1; 
    byte OCIFP4      :1;                                       /* Over-Current Interrupt Flag on PP4 */
    byte OCIFP5      :1;                                       /* Over-Current Interrupt Flag on PP5 */
    byte OCIFP6      :1;                                       /* Over-Current Interrupt Flag on PP6 */
    byte             :1; 
  } Bits;
  struct {
    byte grpOCIFP :1;
    byte         :1;
    byte grpOCIFP_2 :1;
    byte         :1;
    byte grpOCIFP_4 :3;
    byte         :1;
  } MergedBits;
} OCIFPSTR;
