ldom22/EmbeddedTetris/Project_Headers/mc9s12zvc192.h
extern volatile PWM1PER01STR _PWM1PER01 @0x00000514;
#define PWM1PER01                       _PWM1PER01.Word


/*** PWM1PER23 - PWM1 Channel Period 23 Register; 0x00000516 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** PWM1PER2 - PWM1 Channel Period 2 Register; 0x00000516 ***/
    union {
      byte Byte;
    } PWM1PER2STR;
    #define PWM1PER2                    _PWM1PER23.Overlap_STR.PWM1PER2STR.Byte
    

    /*** PWM1PER3 - PWM1 Channel Period 3 Register; 0x00000517 ***/
    union {
      byte Byte;
    } PWM1PER3STR;
    #define PWM1PER3                    _PWM1PER23.Overlap_STR.PWM1PER3STR.Byte
    
  } Overlap_STR;

} PWM1PER23STR;
extern volatile PWM1PER23STR _PWM1PER23 @0x00000516;
#define PWM1PER23                       _PWM1PER23.Word


/*** PWM1PER45 - PWM1 Channel Period 45 Register; 0x00000518 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** PWM1PER4 - PWM1 Channel Period 4 Register; 0x00000518 ***/
    union {
      byte Byte;
    } PWM1PER4STR;
    #define PWM1PER4                    _PWM1PER45.Overlap_STR.PWM1PER4STR.Byte
    

    /*** PWM1PER5 - PWM1 Channel Period 5 Register; 0x00000519 ***/
    union {
      byte Byte;
    } PWM1PER5STR;
    #define PWM1PER5                    _PWM1PER45.Overlap_STR.PWM1PER5STR.Byte
    
  } Overlap_STR;

} PWM1PER45STR;
extern volatile PWM1PER45STR _PWM1PER45 @0x00000518;
#define PWM1PER45                       _PWM1PER45.Word


/*** PWM1PER67 - PWM1 Channel Period 67 Register; 0x0000051A ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** PWM1PER6 - PWM1 Channel Period 6 Register; 0x0000051A ***/
    union {
      byte Byte;
    } PWM1PER6STR;
    #define PWM1PER6                    _PWM1PER67.Overlap_STR.PWM1PER6STR.Byte
    

    /*** PWM1PER7 - PWM1 Channel Period 7 Register; 0x0000051B ***/
    union {
      byte Byte;
    } PWM1PER7STR;
    #define PWM1PER7                    _PWM1PER67.Overlap_STR.PWM1PER7STR.Byte
    
  } Overlap_STR;

} PWM1PER67STR;
extern volatile PWM1PER67STR _PWM1PER67 @0x0000051A;
#define PWM1PER67                       _PWM1PER67.Word


/*** PWM1DTY01 - PWM1 Channel Duty 01 Register; 0x0000051C ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** PWM1DTY0 - PWM1 Channel Duty 0 Register; 0x0000051C ***/
    union {
      byte Byte;
    } PWM1DTY0STR;
    #define PWM1DTY0                    _PWM1DTY01.Overlap_STR.PWM1DTY0STR.Byte
    /* PWM1DTY_ARR: Access 8 PWM1DTYx registers in an array */
    #define PWM1DTY_ARR                 ((volatile byte *) &PWM1DTY0)
    

    /*** PWM1DTY1 - PWM1 Channel Duty 1 Register; 0x0000051D ***/
    union {
      byte Byte;
    } PWM1DTY1STR;
    #define PWM1DTY1                    _PWM1DTY01.Overlap_STR.PWM1DTY1STR.Byte
    
  } Overlap_STR;

} PWM1DTY01STR;
extern volatile PWM1DTY01STR _PWM1DTY01 @0x0000051C;
#define PWM1DTY01                       _PWM1DTY01.Word


/*** PWM1DTY23 - PWM1 Channel Duty 23 Register; 0x0000051E ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** PWM1DTY2 - PWM1 Channel Duty 2 Register; 0x0000051E ***/
    union {
      byte Byte;
    } PWM1DTY2STR;
    #define PWM1DTY2                    _PWM1DTY23.Overlap_STR.PWM1DTY2STR.Byte
    

    /*** PWM1DTY3 - PWM1 Channel Duty 3 Register; 0x0000051F ***/
    union {
      byte Byte;
    } PWM1DTY3STR;
    #define PWM1DTY3                    _PWM1DTY23.Overlap_STR.PWM1DTY3STR.Byte
    
  } Overlap_STR;

} PWM1DTY23STR;
extern volatile PWM1DTY23STR _PWM1DTY23 @0x0000051E;
#define PWM1DTY23                       _PWM1DTY23.Word


/*** PWM1DTY45 - PWM1 Channel Duty 45 Register; 0x00000520 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** PWM1DTY4 - PWM1 Channel Duty 4 Register; 0x00000520 ***/
    union {
      byte Byte;
    } PWM1DTY4STR;
    #define PWM1DTY4                    _PWM1DTY45.Overlap_STR.PWM1DTY4STR.Byte
    

    /*** PWM1DTY5 - PWM1 Channel Duty 5 Register; 0x00000521 ***/
    union {
      byte Byte;
    } PWM1DTY5STR;
    #define PWM1DTY5                    _PWM1DTY45.Overlap_STR.PWM1DTY5STR.Byte
    
  } Overlap_STR;

} PWM1DTY45STR;
extern volatile PWM1DTY45STR _PWM1DTY45 @0x00000520;
#define PWM1DTY45                       _PWM1DTY45.Word


/*** PWM1DTY67 - PWM1 Channel Duty 67 Register; 0x00000522 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** PWM1DTY6 - PWM1 Channel Duty 6 Register; 0x00000522 ***/
    union {
      byte Byte;
    } PWM1DTY6STR;
    #define PWM1DTY6                    _PWM1DTY67.Overlap_STR.PWM1DTY6STR.Byte
    

    /*** PWM1DTY7 - PWM1 Channel Duty 7 Register; 0x00000523 ***/
    union {
      byte Byte;
    } PWM1DTY7STR;
    #define PWM1DTY7                    _PWM1DTY67.Overlap_STR.PWM1DTY7STR.Byte
    
  } Overlap_STR;

} PWM1DTY67STR;
extern volatile PWM1DTY67STR _PWM1DTY67 @0x00000522;
#define PWM1DTY67                       _PWM1DTY67.Word


/*** TIM0TIOS - Timer Input Capture/Output Compare Select; 0x000005C0 ***/
typedef union {
  byte Byte;
  struct {
    byte IOS0        :1;                                       /* Input Capture or Output Compare Channel Configuration Bit 0 */
    byte IOS1        :1;                                       /* Input Capture or Output Compare Channel Configuration Bit 1 */
    byte IOS2        :1;                                       /* Input Capture or Output Compare Channel Configuration Bit 2 */
    byte IOS3        :1;                                       /* Input Capture or Output Compare Channel Configuration Bit 3 */
    byte IOS4        :1;                                       /* Input Capture or Output Compare Channel Configuration Bit 4 */
    byte IOS5        :1;                                       /* Input Capture or Output Compare Channel Configuration Bit 5 */
    byte IOS6        :1;                                       /* Input Capture or Output Compare Channel Configuration Bit 6 */
    byte IOS7        :1;                                       /* Input Capture or Output Compare Channel Configuration Bit 7 */
  } Bits;
} TIM0TIOSSTR;
