ldom22/EmbeddedTetris/Project_Headers/mc9s12zvc192.h
#define ADC0CROFF0_CMDRES_OFF0_MASK     127U
#define ADC0CROFF0_CMDRES_OFF0_BITNUM   0U


/*** ADC0CROFF1 - ADC0 Command and Result Offset Register 1; 0x00000625 ***/
typedef union {
  byte Byte;
  struct {
    byte CMDRES_OFF1 :7;                                       /* ADC Command and Result Offset Value refer to CSL_1 and RVL_1 */
    byte             :1; 
  } Bits;
} ADC0CROFF1STR;
extern volatile ADC0CROFF1STR _ADC0CROFF1 @0x00000625;
#define ADC0CROFF1                      _ADC0CROFF1.Byte
#define ADC0CROFF1_CMDRES_OFF1          _ADC0CROFF1.Bits.CMDRES_OFF1

#define ADC0CROFF1_CMDRES_OFF1_MASK     127U
#define ADC0CROFF1_CMDRES_OFF1_BITNUM   0U


/*** DACCTL - DAC control register; 0x00000680 ***/
typedef union {
  byte Byte;
  struct {
    byte DACM        :3;                                       /* Mode select */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte DRIVE       :1;                                       /* Drive select */
    byte FVR         :1;                                       /* Full voltage range */
  } Bits;
} DACCTLSTR;
extern volatile DACCTLSTR _DACCTL @0x00000680;
#define DACCTL                          _DACCTL.Byte
#define DACCTL_DACM                     _DACCTL.Bits.DACM
#define DACCTL_DRIVE                    _DACCTL.Bits.DRIVE
#define DACCTL_FVR                      _DACCTL.Bits.FVR

#define DACCTL_DACM_MASK                7U
#define DACCTL_DACM_BITNUM              0U
#define DACCTL_DRIVE_MASK               64U
#define DACCTL_FVR_MASK                 128U


/*** DACVOL - DAC analog output voltage level register; 0x00000682 ***/
typedef union {
  byte Byte;
  struct {
    byte VOLTAGE     :8;                                       /* Defines (together with the FVR bit) the analog output voltage */
  } Bits;
} DACVOLSTR;
extern volatile DACVOLSTR _DACVOL @0x00000682;
#define DACVOL                          _DACVOL.Byte
#define DACVOL_VOLTAGE                  _DACVOL.Bits.VOLTAGE

#define DACVOL_VOLTAGE_MASK             255U
#define DACVOL_VOLTAGE_BITNUM           0U


/*** ACMP0C0 - ACMP0 ACMP Control 0 Register; 0x00000690 ***/
typedef union {
  byte Byte;
  struct {
    byte ACMOD       :2;                                       /* ACMP Mode */
    byte ACHYS       :2;                                       /* ACMP Hysteresis */
    byte ACDLY       :1;                                       /* ACMP Input Filter Select for Inputs ACMP0 and ACMP1 */
    byte ACOPS       :1;                                       /* ACMP Output Polarity Select */
    byte ACOPE       :1;                                       /* ACMP Output Pin Enable */
    byte ACE         :1;                                       /* ACMP Enable */
  } Bits;
} ACMP0C0STR;
extern volatile ACMP0C0STR _ACMP0C0 @0x00000690;
#define ACMP0C0                         _ACMP0C0.Byte
#define ACMP0C0_ACMOD                   _ACMP0C0.Bits.ACMOD
#define ACMP0C0_ACHYS                   _ACMP0C0.Bits.ACHYS
#define ACMP0C0_ACDLY                   _ACMP0C0.Bits.ACDLY
#define ACMP0C0_ACOPS                   _ACMP0C0.Bits.ACOPS
#define ACMP0C0_ACOPE                   _ACMP0C0.Bits.ACOPE
#define ACMP0C0_ACE                     _ACMP0C0.Bits.ACE
/* ACMP0C_ARR: Access 3 ACMP0Cx registers in an array */
#define ACMP0C_ARR                      ((volatile byte *) &ACMP0C0)

#define ACMP0C0_ACMOD_MASK              3U
#define ACMP0C0_ACMOD_BITNUM            0U
#define ACMP0C0_ACHYS_MASK              12U
#define ACMP0C0_ACHYS_BITNUM            2U
#define ACMP0C0_ACDLY_MASK              16U
#define ACMP0C0_ACOPS_MASK              32U
#define ACMP0C0_ACOPE_MASK              64U
#define ACMP0C0_ACE_MASK                128U


/*** ACMP0C1 - ACMP0 Control 1 Register; 0x00000691 ***/
typedef union {
  byte Byte;
  struct {
    byte ACNSEL      :2;                                       /* ACMP Negative Input Select */
    byte             :1; 
    byte             :1; 
    byte ACPSEL      :2;                                       /* ACMP Positive Input Select */
    byte             :1; 
    byte             :1; 
  } Bits;
} ACMP0C1STR;
extern volatile ACMP0C1STR _ACMP0C1 @0x00000691;
#define ACMP0C1                         _ACMP0C1.Byte
#define ACMP0C1_ACNSEL                  _ACMP0C1.Bits.ACNSEL
#define ACMP0C1_ACPSEL                  _ACMP0C1.Bits.ACPSEL

#define ACMP0C1_ACNSEL_MASK             3U
#define ACMP0C1_ACNSEL_BITNUM           0U
#define ACMP0C1_ACPSEL_MASK             48U
#define ACMP0C1_ACPSEL_BITNUM           4U


/*** ACMP0C2 - ACMP0 Control 2 Register; 0x00000692 ***/
typedef union {
  byte Byte;
  struct {
    byte ACIE        :1;                                       /* ACMP Interrupt Enable */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
} ACMP0C2STR;
extern volatile ACMP0C2STR _ACMP0C2 @0x00000692;
#define ACMP0C2                         _ACMP0C2.Byte
#define ACMP0C2_ACIE                    _ACMP0C2.Bits.ACIE

#define ACMP0C2_ACIE_MASK               1U


/*** ACMP0S - ACMP0 Status Register; 0x00000693 ***/
typedef union {
  byte Byte;
  struct {
    byte ACIF        :1;                                       /* ACMP Interrupt Flag */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte ACO         :1;                                       /* ACMP Output */
  } Bits;
} ACMP0SSTR;
extern volatile ACMP0SSTR _ACMP0S @0x00000693;
#define ACMP0S                          _ACMP0S.Byte
#define ACMP0S_ACIF                     _ACMP0S.Bits.ACIF
#define ACMP0S_ACO                      _ACMP0S.Bits.ACO

#define ACMP0S_ACIF_MASK                1U
#define ACMP0S_ACO_MASK                 128U


/*** ACMP1C0 - ACMP1 ACMP Control 0 Register; 0x00000698 ***/
typedef union {
  byte Byte;
  struct {
    byte ACMOD       :2;                                       /* ACMP Mode */
    byte ACHYS       :2;                                       /* ACMP Hysteresis */
    byte ACDLY       :1;                                       /* ACMP Input Filter Select for Inputs ACMP0 and ACMP1 */
    byte ACOPS       :1;                                       /* ACMP Output Polarity Select */
    byte ACOPE       :1;                                       /* ACMP Output Pin Enable */
    byte ACE         :1;                                       /* ACMP Enable */
  } Bits;
} ACMP1C0STR;
