ldom22/EmbeddedTetris/Project_Headers/mc9s12zvc192.h
extern volatile ACMP1C0STR _ACMP1C0 @0x00000698;
#define ACMP1C0                         _ACMP1C0.Byte
#define ACMP1C0_ACMOD                   _ACMP1C0.Bits.ACMOD
#define ACMP1C0_ACHYS                   _ACMP1C0.Bits.ACHYS
#define ACMP1C0_ACDLY                   _ACMP1C0.Bits.ACDLY
#define ACMP1C0_ACOPS                   _ACMP1C0.Bits.ACOPS
#define ACMP1C0_ACOPE                   _ACMP1C0.Bits.ACOPE
#define ACMP1C0_ACE                     _ACMP1C0.Bits.ACE
/* ACMP1C_ARR: Access 3 ACMP1Cx registers in an array */
#define ACMP1C_ARR                      ((volatile byte *) &ACMP1C0)

#define ACMP1C0_ACMOD_MASK              3U
#define ACMP1C0_ACMOD_BITNUM            0U
#define ACMP1C0_ACHYS_MASK              12U
#define ACMP1C0_ACHYS_BITNUM            2U
#define ACMP1C0_ACDLY_MASK              16U
#define ACMP1C0_ACOPS_MASK              32U
#define ACMP1C0_ACOPE_MASK              64U
#define ACMP1C0_ACE_MASK                128U


/*** ACMP1C1 - ACMP1 Control 1 Register; 0x00000699 ***/
typedef union {
  byte Byte;
  struct {
    byte ACNSEL      :2;                                       /* ACMP Negative Input Select */
    byte             :1; 
    byte             :1; 
    byte ACPSEL      :2;                                       /* ACMP Positive Input Select */
    byte             :1; 
    byte             :1; 
  } Bits;
} ACMP1C1STR;
extern volatile ACMP1C1STR _ACMP1C1 @0x00000699;
#define ACMP1C1                         _ACMP1C1.Byte
#define ACMP1C1_ACNSEL                  _ACMP1C1.Bits.ACNSEL
#define ACMP1C1_ACPSEL                  _ACMP1C1.Bits.ACPSEL

#define ACMP1C1_ACNSEL_MASK             3U
#define ACMP1C1_ACNSEL_BITNUM           0U
#define ACMP1C1_ACPSEL_MASK             48U
#define ACMP1C1_ACPSEL_BITNUM           4U


/*** ACMP1C2 - ACMP1 Control 2 Register; 0x0000069A ***/
typedef union {
  byte Byte;
  struct {
    byte ACIE        :1;                                       /* ACMP Interrupt Enable */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
} ACMP1C2STR;
extern volatile ACMP1C2STR _ACMP1C2 @0x0000069A;
#define ACMP1C2                         _ACMP1C2.Byte
#define ACMP1C2_ACIE                    _ACMP1C2.Bits.ACIE

#define ACMP1C2_ACIE_MASK               1U


/*** ACMP1S - ACMP1 Status Register; 0x0000069B ***/
typedef union {
  byte Byte;
  struct {
    byte ACIF        :1;                                       /* ACMP Interrupt Flag */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte ACO         :1;                                       /* ACMP Output */
  } Bits;
} ACMP1SSTR;
extern volatile ACMP1SSTR _ACMP1S @0x0000069B;
#define ACMP1S                          _ACMP1S.Byte
#define ACMP1S_ACIF                     _ACMP1S.Bits.ACIF
#define ACMP1S_ACO                      _ACMP1S.Bits.ACO

#define ACMP1S_ACIF_MASK                1U
#define ACMP1S_ACO_MASK                 128U


/*** CPMURFLG - CPMU Reset Flags Register; 0x000006C3 ***/
typedef union {
  byte Byte;
  struct {
    byte PMRF        :1;                                       /* PLL Clock Monitor Reset Flag */
    byte OMRF        :1;                                       /* Oscillator Clock Monitor Reset Flag */
    byte             :1; 
    byte COPRF       :1;                                       /* COP Reset Flag */
    byte             :1; 
    byte LVRF        :1;                                       /* Low Voltage Reset Flag */
    byte PORF        :1;                                       /* Power on Reset Flag */
    byte             :1; 
  } Bits;
} CPMURFLGSTR;
extern volatile CPMURFLGSTR _CPMURFLG @0x000006C3;
#define CPMURFLG                        _CPMURFLG.Byte
#define CPMURFLG_PMRF                   _CPMURFLG.Bits.PMRF
#define CPMURFLG_OMRF                   _CPMURFLG.Bits.OMRF
#define CPMURFLG_COPRF                  _CPMURFLG.Bits.COPRF
#define CPMURFLG_LVRF                   _CPMURFLG.Bits.LVRF
#define CPMURFLG_PORF                   _CPMURFLG.Bits.PORF

#define CPMURFLG_PMRF_MASK              1U
#define CPMURFLG_OMRF_MASK              2U
#define CPMURFLG_COPRF_MASK             8U
#define CPMURFLG_LVRF_MASK              32U
#define CPMURFLG_PORF_MASK              64U


/*** CPMUSYNR - CPMU Synthesizer Register; 0x000006C4 ***/
typedef union {
  byte Byte;
  struct {
    byte SYNDIV0     :1;                                       /* Multiplication factor of the IPLL bit 0 */
    byte SYNDIV1     :1;                                       /* Multiplication factor of the IPLL bit 1 */
    byte SYNDIV2     :1;                                       /* Multiplication factor of the IPLL bit 2 */
    byte SYNDIV3     :1;                                       /* Multiplication factor of the IPLL bit 3 */
    byte SYNDIV4     :1;                                       /* Multiplication factor of the IPLL bit 4 */
    byte SYNDIV5     :1;                                       /* Multiplication factor of the IPLL bit 5 */
    byte VCOFRQ0     :1;                                       /* VCO frequency range bit 0 */
    byte VCOFRQ1     :1;                                       /* VCO frequency range bit 1 */
  } Bits;
  struct {
    byte grpSYNDIV :6;
    byte grpVCOFRQ :2;
  } MergedBits;
} CPMUSYNRSTR;
extern volatile CPMUSYNRSTR _CPMUSYNR @0x000006C4;
#define CPMUSYNR                        _CPMUSYNR.Byte
#define CPMUSYNR_SYNDIV0                _CPMUSYNR.Bits.SYNDIV0
#define CPMUSYNR_SYNDIV1                _CPMUSYNR.Bits.SYNDIV1
#define CPMUSYNR_SYNDIV2                _CPMUSYNR.Bits.SYNDIV2
#define CPMUSYNR_SYNDIV3                _CPMUSYNR.Bits.SYNDIV3
#define CPMUSYNR_SYNDIV4                _CPMUSYNR.Bits.SYNDIV4
#define CPMUSYNR_SYNDIV5                _CPMUSYNR.Bits.SYNDIV5
#define CPMUSYNR_VCOFRQ0                _CPMUSYNR.Bits.VCOFRQ0
#define CPMUSYNR_VCOFRQ1                _CPMUSYNR.Bits.VCOFRQ1
#define CPMUSYNR_SYNDIV                 _CPMUSYNR.MergedBits.grpSYNDIV
#define CPMUSYNR_VCOFRQ                 _CPMUSYNR.MergedBits.grpVCOFRQ

#define CPMUSYNR_SYNDIV0_MASK           1U
#define CPMUSYNR_SYNDIV1_MASK           2U
#define CPMUSYNR_SYNDIV2_MASK           4U
#define CPMUSYNR_SYNDIV3_MASK           8U
#define CPMUSYNR_SYNDIV4_MASK           16U
#define CPMUSYNR_SYNDIV5_MASK           32U
#define CPMUSYNR_VCOFRQ0_MASK           64U
#define CPMUSYNR_VCOFRQ1_MASK           128U
#define CPMUSYNR_SYNDIV_MASK            63U
#define CPMUSYNR_SYNDIV_BITNUM          0U
#define CPMUSYNR_VCOFRQ_MASK            192U
#define CPMUSYNR_VCOFRQ_BITNUM          6U


/*** CPMUREFDIV - CPMU Reference Divider Register; 0x000006C5 ***/
typedef union {
  byte Byte;
  struct {
    byte REFDIV0     :1;                                       /* Finer granularity for the IPLL multiplier steps bit 0 */
    byte REFDIV1     :1;                                       /* Finer granularity for the IPLL multiplier steps bit 1 */
    byte REFDIV2     :1;                                       /* Finer granularity for the IPLL multiplier steps bit 2 */
    byte REFDIV3     :1;                                       /* Finer granularity for the IPLL multiplier steps bit 3 */
    byte             :1; 
    byte             :1; 
    byte REFFRQ0     :1;                                       /* IPLL optimal stability and lock time configuration bit 0 */
    byte REFFRQ1     :1;                                       /* IPLL optimal stability and lock time configuration bit 1 */
  } Bits;
  struct {
    byte grpREFDIV :4;
    byte         :1;
    byte         :1;
    byte grpREFFRQ :2;
  } MergedBits;
} CPMUREFDIVSTR;
extern volatile CPMUREFDIVSTR _CPMUREFDIV @0x000006C5;
#define CPMUREFDIV                      _CPMUREFDIV.Byte
#define CPMUREFDIV_REFDIV0              _CPMUREFDIV.Bits.REFDIV0
#define CPMUREFDIV_REFDIV1              _CPMUREFDIV.Bits.REFDIV1
#define CPMUREFDIV_REFDIV2              _CPMUREFDIV.Bits.REFDIV2
#define CPMUREFDIV_REFDIV3              _CPMUREFDIV.Bits.REFDIV3
#define CPMUREFDIV_REFFRQ0              _CPMUREFDIV.Bits.REFFRQ0
#define CPMUREFDIV_REFFRQ1              _CPMUREFDIV.Bits.REFFRQ1
#define CPMUREFDIV_REFDIV               _CPMUREFDIV.MergedBits.grpREFDIV
#define CPMUREFDIV_REFFRQ               _CPMUREFDIV.MergedBits.grpREFFRQ

