ldom22/EmbeddedTetris/Project_Headers/mc9s12zvc192.h
#define CP0SR_CPDT_MASK                 8U
#define CP0SR_CPCLVL_MASK               16U
#define CP0SR_CPCLVH_MASK               32U
#define CP0SR_CPCHVL_MASK               64U
#define CP0SR_CPCHVH_MASK               128U


/*** CP0IE - CAN Physical Layer Interrupt Enable Register; 0x00000996 ***/
typedef union {
  byte Byte;
  struct {
    byte CPOCIE      :1;                                       /* CAN Physical Layer Error Interrupt Enable */
    byte             :1; 
    byte             :1; 
    byte CPDTIE      :1;                                       /* CPTXD-Dominant Timeout Interrupt Enable */
    byte CPVFIE      :1;                                       /* CANL Voltage Failure Low Status Bit */
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
} CP0IESTR;
extern volatile CP0IESTR _CP0IE @0x00000996;
#define CP0IE                           _CP0IE.Byte
#define CP0IE_CPOCIE                    _CP0IE.Bits.CPOCIE
#define CP0IE_CPDTIE                    _CP0IE.Bits.CPDTIE
#define CP0IE_CPVFIE                    _CP0IE.Bits.CPVFIE

#define CP0IE_CPOCIE_MASK               1U
#define CP0IE_CPDTIE_MASK               8U
#define CP0IE_CPVFIE_MASK               16U


/*** CP0IF - CAN Physical Layer Interrupt Flag Register; 0x00000997 ***/
typedef union {
  byte Byte;
  struct {
    byte CLOCIF      :1;                                       /* CANL Over-Current Interrupt Flag */
    byte CHOCIF      :1;                                       /* CANH Over-Current Interrupt Flag */
    byte             :1; 
    byte CPDTIF      :1;                                       /* CAN CPTXD-Dominant Timeout Interrupt Flag */
    byte CLVLIF      :1;                                       /* CANL Voltage Failure Low Interrupt Flag */
    byte CLVHIF      :1;                                       /* CANL Voltage Failure High Interrupt Flag */
    byte CHVLIF      :1;                                       /* CANH Voltage Failure Low Interrupt Flag */
    byte CHVHIF      :1;                                       /* CANH Voltage Failure High Interrupt Flag */
  } Bits;
} CP0IFSTR;
extern volatile CP0IFSTR _CP0IF @0x00000997;
#define CP0IF                           _CP0IF.Byte
#define CP0IF_CLOCIF                    _CP0IF.Bits.CLOCIF
#define CP0IF_CHOCIF                    _CP0IF.Bits.CHOCIF
#define CP0IF_CPDTIF                    _CP0IF.Bits.CPDTIF
#define CP0IF_CLVLIF                    _CP0IF.Bits.CLVLIF
#define CP0IF_CLVHIF                    _CP0IF.Bits.CLVHIF
#define CP0IF_CHVLIF                    _CP0IF.Bits.CHVLIF
#define CP0IF_CHVHIF                    _CP0IF.Bits.CHVHIF

#define CP0IF_CLOCIF_MASK               1U
#define CP0IF_CHOCIF_MASK               2U
#define CP0IF_CPDTIF_MASK               8U
#define CP0IF_CLVLIF_MASK               16U
#define CP0IF_CLVHIF_MASK               32U
#define CP0IF_CHVLIF_MASK               64U
#define CP0IF_CHVHIF_MASK               128U


/*** TICKRATE - SENT Transmitter Tick Rate Register; 0x000009A0 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** TICKRATE_1 - SENT Transmitter Tick Rate Register 1; 0x000009A0 ***/
    union {
      byte Byte;
      struct {
        byte PRE         :6;                                       /* SENTTX Tick Rate Bits [13:8] */
        byte             :1; 
        byte             :1; 
      } Bits;
    } TICKRATE_1STR;
    #define TICKRATE_1                  _TICKRATE.Overlap_STR.TICKRATE_1STR.Byte
    #define TICKRATE_1_PRE              _TICKRATE.Overlap_STR.TICKRATE_1STR.Bits.PRE
    
    #define TICKRATE_1_PRE_MASK         63U
    #define TICKRATE_1_PRE_BITNUM       0U
    

    /*** TICKRATE_0 - SENT Transmitter Tick Rate Register 0; 0x000009A1 ***/
    union {
      byte Byte;
      struct {
        byte PRE         :8;                                       /* SENTTX Tick Rate Bits [7:0] */
      } Bits;
    } TICKRATE_0STR;
    #define TICKRATE_0                  _TICKRATE.Overlap_STR.TICKRATE_0STR.Byte
    #define TICKRATE_0_PRE              _TICKRATE.Overlap_STR.TICKRATE_0STR.Bits.PRE
    
    #define TICKRATE_0_PRE_MASK         255U
    #define TICKRATE_0_PRE_BITNUM       0U
    
  } Overlap_STR;

  struct {
    word PRE         :14;                                      /* SENTTX Tick Rate Bits */
    word             :1; 
    word             :1; 
  } Bits;
} TICKRATESTR;
extern volatile TICKRATESTR _TICKRATE @0x000009A0;
#define TICKRATE                        _TICKRATE.Word
#define TICKRATE_PRE                    _TICKRATE.Bits.PRE

#define TICKRATE_PRE_MASK               16383U
#define TICKRATE_PRE_BITNUM             0U


/*** PPULSE - SENT Transmitter Pause-Pulse Register; 0x000009A2 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** PPULSE_1 - SENT Transmitter Pause-Pulse Register 1; 0x000009A2 ***/
    union {
      byte Byte;
      struct {
        byte PPCOUNT     :3;                                       /* SENTTX Pause Pulse Count Ticks */
        byte             :1; 
        byte             :1; 
        byte             :1; 
        byte PPFIXED     :1;                                       /* SENTTX Fixed Length Pause Pulse */
        byte PPEN        :1;                                       /* SENTTX Pause Pulse Enable */
      } Bits;
    } PPULSE_1STR;
    #define PPULSE_1                    _PPULSE.Overlap_STR.PPULSE_1STR.Byte
    #define PPULSE_1_PPCOUNT            _PPULSE.Overlap_STR.PPULSE_1STR.Bits.PPCOUNT
    #define PPULSE_1_PPFIXED            _PPULSE.Overlap_STR.PPULSE_1STR.Bits.PPFIXED
    #define PPULSE_1_PPEN               _PPULSE.Overlap_STR.PPULSE_1STR.Bits.PPEN
    
    #define PPULSE_1_PPCOUNT_MASK       7U
    #define PPULSE_1_PPCOUNT_BITNUM     0U
    #define PPULSE_1_PPFIXED_MASK       64U
    #define PPULSE_1_PPEN_MASK          128U
    

    /*** PPULSE_0 - SENT Transmitter Pause-Pulse Register 0; 0x000009A3 ***/
    union {
      byte Byte;
      struct {
        byte PPCOUNT     :8;                                       /* SENTTX Pause Pulse Count Ticks */
      } Bits;
    } PPULSE_0STR;
    #define PPULSE_0                    _PPULSE.Overlap_STR.PPULSE_0STR.Byte
    #define PPULSE_0_PPCOUNT            _PPULSE.Overlap_STR.PPULSE_0STR.Bits.PPCOUNT
    
    #define PPULSE_0_PPCOUNT_MASK       255U
    #define PPULSE_0_PPCOUNT_BITNUM     0U
    
  } Overlap_STR;

