ldom22/EmbeddedTetris/Project_Headers/mc9s12zvc192.h
  struct {
    word PPCOUNT     :11;                                      /* SENTTX Pause Pulse Count Ticks */
    word             :1; 
    word             :1; 
    word             :1; 
    word PPFIXED     :1;                                       /* SENTTX Fixed Length Pause Pulse */
    word PPEN        :1;                                       /* SENTTX Pause Pulse Enable */
  } Bits;
} PPULSESTR;
extern volatile PPULSESTR _PPULSE @0x000009A2;
#define PPULSE                          _PPULSE.Word
#define PPULSE_PPCOUNT                  _PPULSE.Bits.PPCOUNT
#define PPULSE_PPFIXED                  _PPULSE.Bits.PPFIXED
#define PPULSE_PPEN                     _PPULSE.Bits.PPEN

#define PPULSE_PPCOUNT_MASK             2047U
#define PPULSE_PPCOUNT_BITNUM           0U
#define PPULSE_PPFIXED_MASK             16384U
#define PPULSE_PPEN_MASK                32768U


/*** CONFIG - SENT Transmitter Configuration Register; 0x000009A4 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** CONFIG_1 - SENT Transmitter Configuration Register 1; 0x000009A4 ***/
    union {
      byte Byte;
      struct {
        byte DNIBBLECOUNT :3;                                      /* SENTTX Data Nibble Count */
        byte             :1; 
        byte             :1; 
        byte             :1; 
        byte TXEN        :1;                                       /* SENTTX Pin Enable */
        byte TXINIT      :1;                                       /* SENTTX Initialization Enable */
      } Bits;
    } CONFIG_1STR;
    #define CONFIG_1                    _CONFIG.Overlap_STR.CONFIG_1STR.Byte
    #define CONFIG_1_DNIBBLECOUNT       _CONFIG.Overlap_STR.CONFIG_1STR.Bits.DNIBBLECOUNT
    #define CONFIG_1_TXEN               _CONFIG.Overlap_STR.CONFIG_1STR.Bits.TXEN
    #define CONFIG_1_TXINIT             _CONFIG.Overlap_STR.CONFIG_1STR.Bits.TXINIT
    
    #define CONFIG_1_DNIBBLECOUNT_MASK  7U
    #define CONFIG_1_DNIBBLECOUNT_BITNUM 0U
    #define CONFIG_1_TXEN_MASK          64U
    #define CONFIG_1_TXINIT_MASK        128U
    

    /*** CONFIG_0 - SENT Transmitter Configuration Register 0; 0x000009A5 ***/
    union {
      byte Byte;
      struct {
        byte CRCBYP      :1;                                       /* SENTTX Automatic CRC generation bypass */
        byte CRCLEG      :1;                                       /* SENTTX CRC Legacy Algorithm Enable */
        byte CRCSCN      :1;                                       /* SENTTX CRC includes Status- and Communication Nibble */
        byte SINGLE      :1;                                       /* SENTTX Single Shot Operation */
        byte OPTEDGE     :1;                                       /* SENTTX Optimized Rising Edge Position */
        byte             :1; 
        byte             :1; 
        byte             :1; 
      } Bits;
    } CONFIG_0STR;
    #define CONFIG_0                    _CONFIG.Overlap_STR.CONFIG_0STR.Byte
    #define CONFIG_0_CRCBYP             _CONFIG.Overlap_STR.CONFIG_0STR.Bits.CRCBYP
    #define CONFIG_0_CRCLEG             _CONFIG.Overlap_STR.CONFIG_0STR.Bits.CRCLEG
    #define CONFIG_0_CRCSCN             _CONFIG.Overlap_STR.CONFIG_0STR.Bits.CRCSCN
    #define CONFIG_0_SINGLE             _CONFIG.Overlap_STR.CONFIG_0STR.Bits.SINGLE
    #define CONFIG_0_OPTEDGE            _CONFIG.Overlap_STR.CONFIG_0STR.Bits.OPTEDGE
    
    #define CONFIG_0_CRCBYP_MASK        1U
    #define CONFIG_0_CRCLEG_MASK        2U
    #define CONFIG_0_CRCSCN_MASK        4U
    #define CONFIG_0_SINGLE_MASK        8U
    #define CONFIG_0_OPTEDGE_MASK       16U
    
  } Overlap_STR;

  struct {
    word CRCBYP      :1;                                       /* SENTTX Automatic CRC generation bypass */
    word CRCLEG      :1;                                       /* SENTTX CRC Legacy Algorithm Enable */
    word CRCSCN      :1;                                       /* SENTTX CRC includes Status- and Communication Nibble */
    word SINGLE      :1;                                       /* SENTTX Single Shot Operation */
    word OPTEDGE     :1;                                       /* SENTTX Optimized Rising Edge Position */
    word             :1; 
    word             :1; 
    word             :1; 
    word DNIBBLECOUNT :3;                                      /* SENTTX Data Nibble Count */
    word             :1; 
    word             :1; 
    word             :1; 
    word TXEN        :1;                                       /* SENTTX Pin Enable */
    word TXINIT      :1;                                       /* SENTTX Initialization Enable */
  } Bits;
} CONFIGSTR;
extern volatile CONFIGSTR _CONFIG @0x000009A4;
#define CONFIG                          _CONFIG.Word
#define CONFIG_CRCBYP                   _CONFIG.Bits.CRCBYP
#define CONFIG_CRCLEG                   _CONFIG.Bits.CRCLEG
#define CONFIG_CRCSCN                   _CONFIG.Bits.CRCSCN
#define CONFIG_SINGLE                   _CONFIG.Bits.SINGLE
#define CONFIG_OPTEDGE                  _CONFIG.Bits.OPTEDGE
#define CONFIG_DNIBBLECOUNT             _CONFIG.Bits.DNIBBLECOUNT
#define CONFIG_TXEN                     _CONFIG.Bits.TXEN
#define CONFIG_TXINIT                   _CONFIG.Bits.TXINIT

#define CONFIG_CRCBYP_MASK              1U
#define CONFIG_CRCLEG_MASK              2U
#define CONFIG_CRCSCN_MASK              4U
#define CONFIG_SINGLE_MASK              8U
#define CONFIG_OPTEDGE_MASK             16U
#define CONFIG_DNIBBLECOUNT_MASK        1792U
#define CONFIG_DNIBBLECOUNT_BITNUM      8U
#define CONFIG_TXEN_MASK                16384U
#define CONFIG_TXINIT_MASK              32768U


/*** INTEN - SENT Transmitter Interrupt Enable Register; 0x000009A6 ***/
typedef union {
  byte Byte;
  struct {
    byte TBEIE       :1;                                       /* SENTTX Transmit-Buffer Empty Interrupt Enable */
    byte TCIE        :1;                                       /* SENTTX Transmission Complete Interrupt Enable */
    byte CSIE        :1;                                       /* SENTTX Calibration Start Interrupt Enable */
    byte TUIE        :1;                                       /* SENTTX Transmitter Underrun Interrupt Enable */
    byte PPREIE      :1;                                       /* SENTTX Pause-Pulse Rising-Edge Interrupt Enable */
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
} INTENSTR;
extern volatile INTENSTR _INTEN @0x000009A6;
#define INTEN                           _INTEN.Byte
#define INTEN_TBEIE                     _INTEN.Bits.TBEIE
#define INTEN_TCIE                      _INTEN.Bits.TCIE
#define INTEN_CSIE                      _INTEN.Bits.CSIE
#define INTEN_TUIE                      _INTEN.Bits.TUIE
#define INTEN_PPREIE                    _INTEN.Bits.PPREIE

